Se usa la biblioteca pandas y se explora con ella

In [ ]:
import pandas as pd

 

# Creamos un DataFrame compra a partir de un diccionario data

data ={'manzanas':[3,2,0,1],'naranjas':[0,3,7,2]}

df_compras = pd.DataFrame(data)

df_compras

   manzanas  naranjas
0         3         0
1         2         3
2         0         7
3         1         2

In [ ]:
# Creamos las personas que compran

df_compras = pd.DataFrame(data, index=['Ana', 'Roberto', 'Lily', 'David'])

df_compras

         manzanas  naranjas
Ana             3         0
Roberto         2         3
Lily            0         7
David           1         2

In [ ]:
# Podemos ver que compró Ana (selección del renglón con .loc)
df_compras.loc['Ana']

manzanas    3
naranjas    0
Name: Ana, dtype: int64

In [ ]:
df_compras.to_csv('compras.csv')

In [ ]:
# pandas permite leer archivos cav, Excel y otros formatos
df_compras = pd.read_csv('compras.csv')

In [ ]:
df_compras.head()

  Unnamed: 0  manzanas  naranjas
0        Ana         3         0
1    Roberto         2         3
2       Lily         0         7
3      David         1         2

In [ ]:
df_compras.rename(columns={'Unnamed: 0' : 'Nombre'}, inplace=True)

In [ ]:
df_compras.head()

    Nombre  manzanas  naranjas
0      Ana         3         0
1  Roberto         2         3
2     Lily         0         7
3    David         1         2

In [ ]:
df_compras.shape

(4, 3)

In [ ]:
df_compras.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   manzanas  4 non-null      int64
 2   naranjas  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [ ]:
df_compras.describe()

       manzanas  naranjas
count  4.000000   4.00000
mean   1.500000   3.00000
std    1.290994   2.94392
min    0.000000   0.00000
25%    0.750000   1.50000
50%    1.500000   2.50000
75%    2.250000   4.00000
max    3.000000   7.00000

In [48]:
# Creación de un ejemplo de DataFrame con valores aleatorios
from numpy.random import randn
df = pd.DataFrame(randn(6,4),index='0 1 2 3 4 5'.split(),columns='A B C D'.split())

In [49]:
df

          A         B         C         D
0 -0.007857  0.029273  0.458973  1.294689
1 -1.447663 -0.863712  1.317655 -0.847043
2  1.083452 -0.820827 -0.321457  0.784296
3 -0.575979 -0.232530 -0.007624  0.884733
4 -0.042168  0.613352 -0.669029 -1.565413
5  0.222308  0.144232  1.133568  0.282620

In [50]:
# Imprime el tercer renglon con etiqueta '4' 
df.loc['4']

A   -0.042168
B    0.613352
C   -0.669029
D   -1.565413
Name: 4, dtype: float64

In [51]:
# Imprime el renglón con índice 4
df.iloc[4]

A   -0.042168
B    0.613352
C   -0.669029
D   -1.565413
Name: 4, dtype: float64

In [53]:
# Imprime un elemento específico. 
df.loc['4', 'C']

-0.6690286512798718

In [56]:
# Imprime un rango de renglones
df.loc['1':'5']

          A         B         C         D
1 -1.447663 -0.863712  1.317655 -0.847043
2  1.083452 -0.820827 -0.321457  0.784296
3 -0.575979 -0.232530 -0.007624  0.884733
4 -0.042168  0.613352 -0.669029 -1.565413
5  0.222308  0.144232  1.133568  0.282620

In [58]:
# Indica donde se cumple la condición
df>0.7

       A      B      C      D
0  False  False  False   True
1  False  False   True  False
2   True  False  False   True
3  False  False  False   True
4  False  False  False  False
5  False  False   True  False

In [59]:
df

          A         B         C         D
0 -0.007857  0.029273  0.458973  1.294689
1 -1.447663 -0.863712  1.317655 -0.847043
2  1.083452 -0.820827 -0.321457  0.784296
3 -0.575979 -0.232530 -0.007624  0.884733
4 -0.042168  0.613352 -0.669029 -1.565413
5  0.222308  0.144232  1.133568  0.282620

Aqui se inserta el archivo meteorlogógico de la actividad 1

In [1]:
import numpy as np

import pandas as pd

url = 'https://raw.githubusercontent.com/Hannahborrego17/Fisicacomputacional1/master/Actividad%201/datos%20diarios.txt'

df = pd.read_csv(url)
print(df.head(100))

                     CNA-SMN-CG-GMC-SMAA-CLIMATOLOGIA
0                         BASE DE DATOS CLIMATOLOGICA
1   DATOS DISPONIBLES EN LA BASE DE DATOS A MARZO ...
2                                   ESTACION  : 26089
3                         NOMBRE    : SANTA ANA (DGE)
4                                  ESTADO    : SONORA
..                                                ...
95                22/03/1950  0     Nulo    37     6
96                23/03/1950  0     Nulo    38     8
97                24/03/1950  0     Nulo    34     2
98                25/03/1950  0     Nulo    32     2
99                26/03/1950  0     Nulo    21     0

[100 rows x 1 columns]

In [60]:
import pandas as pd
import numpy as np

#archivo en formato raw
url = 'https://raw.githubusercontent.com/Hannahborrego17/Fisicacomputacional1/master/Actividad%201/datos%20diarios.txt'

my_cols = ['Fecha', 'precip', 'Evap', 'Tmax', 'Tmin']
df_dist = pd.read_csv(url, names=my_cols, encoding='cp1251', sep='\s+', header=None, skiprows=19, skipfooter=1, engine='python')

In [61]:
# revisamosel encabezado y el final del dataframe

print(df_dist.head())
print(df_dist.tail())

        Fecha precip  Evap Tmax Tmin
0  01/01/1950      0  Nulo   34    9
1  02/01/1950      0  Nulo   25   12
2  03/01/1950      0  Nulo   30   13
3  04/01/1950      0  Nulo   20    8
4  05/01/1950      0  Nulo   28    5
            Fecha precip  Evap  Tmax Tmin
18117  26/11/2005      0     6    31    6
18118  27/11/2005      0     6    31    6
18119  28/11/2005      0     5    31    6
18120  29/11/2005      0     6    30    6
18121  30/11/2005      0  Nulo  Nulo    5

Aqui vemos que nuestro data frame tiene 18122 renglones y 5 columnas

In [21]:
# tamaño (renglones,columnas)
df_dist.shape

(18122, 5)

In [71]:
# Información del dataframe
df_dist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18122 entries, 0 to 18121
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   18122 non-null  object
 1   precip  18122 non-null  object
 2   Evap    18122 non-null  object
 3   Tmax    18122 non-null  object
 4   Tmin    18122 non-null  object
dtypes: object(5)
memory usage: 708.0+ KB

In [24]:
# copia del trabajo y se preserva el dataframe original

df_work0 = df_dist.copy()
df_work0.head()

        Fecha precip  Evap Tmax Tmin
0  01/01/1950      0  Nulo   34    9
1  02/01/1950      0  Nulo   25   12
2  03/01/1950      0  Nulo   30   13
3  04/01/1950      0  Nulo   20    8
4  05/01/1950      0  Nulo   28    5

In [28]:
# remplazamos los textos nulo por los espaccios en blanco
str_Nulo = 'Nulo'
df_work1 = df_work0.replace(to_replace=str_Nulo, value='', regex=True)
df_work1.head()

        Fecha precip Evap Tmax Tmin
0  01/01/1950      0        34    9
1  02/01/1950      0        25   12
2  03/01/1950      0        30   13
3  04/01/1950      0        20    8
4  05/01/1950      0        28    5

In [29]:
# información actualizada
df_work1.info()
print(df_work1.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18122 entries, 0 to 18121
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   18122 non-null  object
 1   precip  18122 non-null  object
 2   Evap    18122 non-null  object
 3   Tmax    18122 non-null  object
 4   Tmin    18122 non-null  object
dtypes: object(5)
memory usage: 708.0+ KB
        Fecha precip Evap Tmax Tmin
0  01/01/1950      0        34    9
1  02/01/1950      0        25   12
2  03/01/1950      0        30   13
3  04/01/1950      0        20    8
4  05/01/1950      0        28    5

In [34]:
# convertit variables a constantes
cols_list = ['precip', 'Evap', 'Tmax', 'Tmin']
for cols in cols_list:
  df_work:[cols] = pd.to_numeric(df_work1[cols], errors='coerce')
df_work1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18122 entries, 0 to 18121
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   18122 non-null  object
 1   precip  18122 non-null  object
 2   Evap    18122 non-null  object
 3   Tmax    18122 non-null  object
 4   Tmin    18122 non-null  object
dtypes: object(5)
memory usage: 708.0+ KB

In [35]:
# sumamos los valores nulos
df_work1.isnull().sum()

Fecha     0
precip    0
Evap      0
Tmax      0
Tmin      0
dtype: int64

In [36]:
print(df_work1.head())
print(df_work1.head())

        Fecha precip Evap Tmax Tmin
0  01/01/1950      0        34    9
1  02/01/1950      0        25   12
2  03/01/1950      0        30   13
3  04/01/1950      0        20    8
4  05/01/1950      0        28    5
        Fecha precip Evap Tmax Tmin
0  01/01/1950      0        34    9
1  02/01/1950      0        25   12
2  03/01/1950      0        30   13
3  04/01/1950      0        20    8
4  05/01/1950      0        28    5

In [39]:
# un analisis estadístico breve de las variables numericas redondeando a 2 cifras significativas
df_work1.describe().round(2)

             Fecha precip   Evap   Tmax   Tmin
count        18122  18122  18122  18122  18122
unique       18122    211    171     94    101
top     28/02/1978      0            36      6
freq             1  16727   8486    979   1035

Parte 3 se experimenta con las fechas

In [64]:
# Ahora vamos con las fechas
df_work2 = df_work1.copy()
df_work2['Fecha'].head()

0    01/01/1950
1    02/01/1950
2    03/01/1950
3    04/01/1950
4    05/01/1950
Name: Fecha, dtype: object

In [65]:
df_work2['Fecha']=pd.to_datetime(df_work2['Fecha'], dayfirst=True).copy()
print(df_work1.head())

        Fecha precip Evap Tmax Tmin
0  01/01/1950      0        34    9
1  02/01/1950      0        25   12
2  03/01/1950      0        30   13
3  04/01/1950      0        20    8
4  05/01/1950      0        28    5

In [66]:
df_work2.dtypes

Fecha     datetime64[ns]
precip            object
Evap              object
Tmax              object
Tmin              object
dtype: object

In [68]:
# Buscamos ahora añadir dos columnas adicionales: df['Año'], df['Mes']
# Usaremos la función .dt.year y .dt.month para extraer el Año y Mes de la Fecha
df_work2['Año'] = df_work2['Fecha'].dt.year
df_work2['Mes'] = df_work2['Fecha'].dt.month

In [69]:
print(df_work2.head())
print(df_work2.tail())

       Fecha precip Evap Tmax Tmin   Año  Mes
0 1950-01-01      0        34    9  1950    1
1 1950-01-02      0        25   12  1950    1
2 1950-01-03      0        30   13  1950    1
3 1950-01-04      0        20    8  1950    1
4 1950-01-05      0        28    5  1950    1
           Fecha precip Evap Tmax Tmin   Año  Mes
18117 2005-11-26      0    6   31    6  2005   11
18118 2005-11-27      0    6   31    6  2005   11
18119 2005-11-28      0    5   31    6  2005   11
18120 2005-11-29      0    6   30    6  2005   11
18121 2005-11-30      0              5  2005   11

In [70]:
df_work2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18122 entries, 0 to 18121
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   18122 non-null  datetime64[ns]
 1   precip  18122 non-null  object
 2   Evap    18122 non-null  object
 3   Tmax    18122 non-null  object
 4   Tmin    18122 non-null  object
 5   Año     18122 non-null  int64
 6   Mes     18122 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 991.2+ KB